tap "azure/functions"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "minio/stable"
brew "antiword"
brew "glib"
brew "python@3.12"
brew "cmake"
brew "lima"
brew "colima"
brew "direnv"
brew "docker", link: false
brew "fd"
brew "gh"
brew "git-lfs"
brew "go"
brew "harfbuzz"
brew "graphviz"
brew "htop"
brew "jq"
brew "libpq", link: true
brew "md5sha1sum"
brew "mysql"
brew "neovim"
brew "ninja"
brew "openjdk@17"
brew "postgresql@14", link: false
brew "postgresql@15"
brew "postgresql@16"
brew "pre-commit"
brew "qemu"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "thefuck"
brew "tmux"
brew "tree"
brew "websocat"
brew "wget"
brew "wrk"
brew "zsh-syntax-highlighting"
brew "azure/functions/azure-functions-core-tools@4"
brew "hashicorp/tap/terraform"
brew "minio/stable/mc"
brew "minio/stable/minio"
cask "font-hack-nerd-font"
cask "keycastr"
cask "monitorcontrol"
cask "snowflake-snowsql"
vscode "bierner.markdown-mermaid"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
