tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "glib"
brew "python@3.13"
brew "cmake"
brew "lima"
brew "colima"
brew "direnv"
brew "docker", link: false
brew "fd"
brew "gh"
brew "git-lfs"
brew "go"
brew "harfbuzz"
brew "graphviz"
brew "htop"
brew "jq"
brew "libpq", link: true
brew "md5sha1sum"
brew "neovim"
brew "ninja"
brew "openjdk@17"
brew "pre-commit"
brew "pyright"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "tree"
brew "wget"
brew "wrk"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
cask "font-hack-nerd-font"
cask "monitorcontrol"
